## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure[0].azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "lead-scoring-insights"
      + resource_group_name                   = "lead-scoring-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + workspace_id                          = (known after apply)
    }

  # module.azure[0].azurerm_container_app.main will be created
  + resource "azurerm_container_app" "main" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "lead-scoring-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "lead-scoring-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = (known after apply)
          + username             = (known after apply)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 2
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/OscarSantosMu/b2b-lead-scoring-model-serving:latest"
              + memory            = "1Gi"
              + name              = "api"

              + env {
                  + name  = "ENV"
                  + value = "dev"
                }
              + env {
                  + name  = "LOG_LEVEL"
                  + value = "INFO"
                }
              + env {
                  + name  = "MODEL_ENDPOINT_PROVIDER"
                  + value = "local"
                }
              + env {
                  + name  = "API_KEYS"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
              + env {
                  + name = "AZURE_ML_ENDPOINT_URL"
                }
              + env {
                  + name = "AZURE_ML_API_KEY"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 30
                  + path                             = "/health/live"
                  + port                             = 8000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health/ready"
                  + port                    = 8000
                  + success_count_threshold = 3
                  + timeout                 = 3
                  + transport               = "HTTP"
                }
            }

          + http_scale_rule {
              + concurrent_requests = "100"
              + name                = "http-scaling"
            }
        }
    }

  # module.azure[0].azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "lead-scoring-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "lead-scoring-dev-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + zone_redundancy_enabled          = false
    }

  # module.azure[0].azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "leadscoringdevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "lead-scoring-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.azure[0].azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "lead-scoring-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "lead-scoring-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + workspace_id                    = (known after apply)
    }

  # module.azure[0].azurerm_monitor_metric_alert.high_cpu will be created
  + resource "azurerm_monitor_metric_alert" "high_cpu" {
      + auto_mitigate            = true
      + description              = "Alert when CPU usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "lead-scoring-high-cpu"
      + resource_group_name      = "lead-scoring-dev-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "CpuPercentage"
          + metric_namespace       = "Microsoft.App/containerApps"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.azure[0].azurerm_monitor_metric_alert.high_memory will be created
  + resource "azurerm_monitor_metric_alert" "high_memory" {
      + auto_mitigate            = true
      + description              = "Alert when memory usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "lead-scoring-high-memory"
      + resource_group_name      = "lead-scoring-dev-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "MemoryPercentage"
          + metric_namespace       = "Microsoft.App/containerApps"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.azure[0].azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "lead-scoring-dev-rg"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server                     = (known after apply)
  + api_url                              = (known after apply)
  + azure_api_url                        = (known after apply)
  + azure_app_insights_connection_string = (sensitive value)
  + container_registry_url               = (known after apply)
  + deployed_cloud_provider              = "azure"
```
</details>